
[net]
angle=0
saturation=1.1
learning_rate=0.0025
width=480
policy=steps
decay=0.0005
momentum=0.9
max_batches=33000
burn_in=5000
channels=3
subdivisions=8
hue=.01
height=480
steps=20000,26000
batch=64
exposure=1.1
scales=.1,.2

[convolutional]
pad=1
activation=leaky
filters=16
stride=1
batch_normalize=1
size=3

[maxpool]
stride=2
size=2

[convolutional]
pad=1
activation=leaky
filters=32
stride=1
batch_normalize=1
size=3

[maxpool]
stride=2
size=2

[convolutional]
pad=1
activation=leaky
filters=64
stride=1
batch_normalize=1
size=3

[maxpool]
stride=2
size=2

[convolutional]
pad=1
activation=leaky
filters=128
stride=1
batch_normalize=1
size=3

[maxpool]
stride=2
size=2

[convolutional]
pad=1
activation=leaky
filters=256
stride=1
batch_normalize=1
size=3

[maxpool]
stride=2
size=2

[convolutional]
pad=1
activation=leaky
filters=512
stride=1
batch_normalize=1
size=3

[maxpool]
stride=1
size=2

[convolutional]
pad=1
activation=leaky
filters=1024
stride=1
batch_normalize=1
size=3

[convolutional]
pad=1
activation=leaky
filters=256
stride=1
batch_normalize=1
size=1

[convolutional]
pad=1
activation=leaky
filters=512
stride=1
batch_normalize=1
size=3

[convolutional]
pad=1
stride=1
activation=linear
filters=252
size=1

[yolo]
num=6
classes=79
mask=3,4,5
truth_thresh=1
jitter=0.0
ignore_thresh=.5
anchors= 27, 16,  41, 23,  76, 35, 193, 34, 430, 37, 168, 97
random=1

[route]
layers=-4

[convolutional]
pad=1
activation=leaky
filters=128
stride=1
batch_normalize=1
size=1

[upsample]
stride=2

[route]
layers=-1, 8

[convolutional]
pad=1
activation=leaky
filters=256
stride=1
batch_normalize=1
size=3

[convolutional]
pad=1
stride=1
activation=linear
filters=252
size=1

[yolo]
num=6
classes=79
mask=0,1,2
truth_thresh=1
jitter=0.0
ignore_thresh=.5
anchors= 27, 16,  41, 23,  76, 35, 193, 34, 430, 37, 168, 97
random=1