
[net]
width=480
decay=0.0005
momentum=0.9
batch=64
max_batches=17000
hue=.1
saturation=1.5
steps=400,450
burn_in=3000
scales=.1,.1
policy=steps
subdivisions=16
channels=3
learning_rate=0.00025
exposure=1.0
height=480
angle=0

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=32

[convolutional]
stride=2
size=3
pad=1
batch_normalize=1
activation=leaky
filters=64

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=32

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=64

[shortcut]
from=-3
activation=linear

[convolutional]
stride=2
size=3
pad=1
batch_normalize=1
activation=leaky
filters=128

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=64

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=128

[shortcut]
from=-3
activation=linear

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=64

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=128

[shortcut]
from=-3
activation=linear

[convolutional]
stride=2
size=3
pad=1
batch_normalize=1
activation=leaky
filters=256

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=128

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=256

[shortcut]
from=-3
activation=linear

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=128

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=256

[shortcut]
from=-3
activation=linear

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=128

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=256

[shortcut]
from=-3
activation=linear

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=128

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=256

[shortcut]
from=-3
activation=linear

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=128

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=256

[shortcut]
from=-3
activation=linear

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=128

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=256

[shortcut]
from=-3
activation=linear

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=128

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=256

[shortcut]
from=-3
activation=linear

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=128

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=256

[shortcut]
from=-3
activation=linear

[convolutional]
stride=2
size=3
pad=1
batch_normalize=1
activation=leaky
filters=512

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=256

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=512

[shortcut]
from=-3
activation=linear

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=256

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=512

[shortcut]
from=-3
activation=linear

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=256

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=512

[shortcut]
from=-3
activation=linear

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=256

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=512

[shortcut]
from=-3
activation=linear

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=256

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=512

[shortcut]
from=-3
activation=linear

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=256

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=512

[shortcut]
from=-3
activation=linear

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=256

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=512

[shortcut]
from=-3
activation=linear

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=256

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=512

[shortcut]
from=-3
activation=linear

[convolutional]
stride=2
size=3
pad=1
batch_normalize=1
activation=leaky
filters=1024

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=512

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=1024

[shortcut]
from=-3
activation=linear

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=512

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=1024

[shortcut]
from=-3
activation=linear

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=512

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=1024

[shortcut]
from=-3
activation=linear

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=512

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=1024

[shortcut]
from=-3
activation=linear

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=512

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=1024

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=512

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=1024

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=512

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=1024

[convolutional]
pad=1
stride=1
activation=linear
filters=102
size=1

[yolo]
anchors=29.4367,19.0920, 47.0341,24.5969, 88.6245,40.5065, 149.7607,35.4194, 223.0394,33.9181, 313.0470,34.1938, 397.0328,35.4805, 456.9831,39.5454, 198.5710,108.5970
jitter=0.0
mask=6,7,8
random=1
truth_thresh=1
num=9
classes=29
ignore_thresh=.5

[route]
layers=-4

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=256

[upsample]
stride=2

[route]
layers=-1, 61

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=256

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=512

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=256

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=512

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=256

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=512

[convolutional]
pad=1
stride=1
activation=linear
filters=102
size=1

[yolo]
anchors=29.4367,19.0920, 47.0341,24.5969, 88.6245,40.5065, 149.7607,35.4194, 223.0394,33.9181, 313.0470,34.1938, 397.0328,35.4805, 456.9831,39.5454, 198.5710,108.5970
jitter=0.0
mask=3,4,5
random=1
truth_thresh=1
num=9
classes=29
ignore_thresh=.5

[route]
layers=-4

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=128

[upsample]
stride=2

[route]
layers=-1, 36

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=128

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=256

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=128

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=256

[convolutional]
stride=1
size=1
pad=1
batch_normalize=1
activation=leaky
filters=128

[convolutional]
stride=1
size=3
pad=1
batch_normalize=1
activation=leaky
filters=256

[convolutional]
pad=1
stride=1
activation=linear
filters=102
size=1

[yolo]
anchors=29.4367,19.0920, 47.0341,24.5969, 88.6245,40.5065, 149.7607,35.4194, 223.0394,33.9181, 313.0470,34.1938, 397.0328,35.4805, 456.9831,39.5454, 198.5710,108.5970
jitter=0.0
mask=0,1,2
random=1
truth_thresh=1
num=9
classes=29
ignore_thresh=.5